PS C:\Users\Bogdan\Documents\GitHub\Intelligent-Tools-for-Social-Good\facial-expression-recognition-tf\facial-expression-recognition-tf> python .\tf_model.py                                                                                   Using TensorFlow backend.
2019-12-08 17:52:59.653134: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cudart64_100.dll
C:\Users\Bogdan\Documents\GitHub\Intelligent-Tools-for-Social-Good\facial-expression-recognition-tf\facial-expression-recognition-tf\data_loader.py:27: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  emotions = pd.get_dummies(data['emotion']).as_matrix()
WARNING:tensorflow:From C:\Users\Bogdan\AppData\Local\Programs\Python\Python37\lib\site-packages\tensorflow_core\python\ops\resource_variable_ops.py:1630: calling BaseResourceVariable.__init__ (from tensorflow.python.ops.resource_variable_ops) with constraint is deprecated and will be removed in a future version.
Instructions for updating:
If using Keras pass *_constraint arguments to layers.
2019-12-08 17:53:26.282210: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library nvcuda.dll
2019-12-08 17:53:26.828685: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1618] Found device 0 with properties:
name: Quadro M520 major: 5 minor: 0 memoryClockRate(GHz): 1.176
pciBusID: 0000:02:00.0
2019-12-08 17:53:26.835318: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cudart64_100.dll
2019-12-08 17:53:26.842633: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cublas64_100.dll
2019-12-08 17:53:26.851283: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cufft64_100.dll
2019-12-08 17:53:26.858371: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library curand64_100.dll
2019-12-08 17:53:26.866459: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cusolver64_100.dll
2019-12-08 17:53:26.874731: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cusparse64_100.dll
2019-12-08 17:53:26.889334: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cudnn64_7.dll
2019-12-08 17:53:26.896169: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1746] Adding visible gpu devices: 0
2019-12-08 17:53:26.900123: I tensorflow/core/platform/cpu_feature_guard.cc:142] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2
2019-12-08 17:53:26.907701: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1618] Found device 0 with properties:
name: Quadro M520 major: 5 minor: 0 memoryClockRate(GHz): 1.176
pciBusID: 0000:02:00.0
2019-12-08 17:53:26.913978: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cudart64_100.dll
2019-12-08 17:53:26.918547: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cublas64_100.dll
2019-12-08 17:53:26.922619: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cufft64_100.dll
2019-12-08 17:53:26.927841: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library curand64_100.dll
2019-12-08 17:53:26.931832: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cusolver64_100.dll
2019-12-08 17:53:26.936420: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cusparse64_100.dll
2019-12-08 17:53:26.941762: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cudnn64_7.dll
2019-12-08 17:53:26.948489: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1746] Adding visible gpu devices: 0
2019-12-08 17:53:28.356077: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1159] Device interconnect StreamExecutor with strength 1 edge matrix:
2019-12-08 17:53:28.361483: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1165]      0
2019-12-08 17:53:28.364444: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1178] 0:   N
2019-12-08 17:53:28.368710: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1304] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:0 with 1384 MB memory) -> physical GPU (device: 0, name: Quadro M520, pci bus id: 0000:02:00.0, compute capability: 5.0)
WARNING:tensorflow:From C:\Users\Bogdan\AppData\Local\Programs\Python\Python37\lib\site-packages\keras\backend\tensorflow_backend.py:4070: The name tf.nn.max_pool is deprecated. Please use tf.nn.max_pool2d instead.

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 48, 48, 1)    0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 46, 46, 8)    72          input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 46, 46, 8)    32          conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 46, 46, 8)    0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 44, 44, 8)    576         activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 44, 44, 8)    32          conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 44, 44, 8)    0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 44, 44, 16)   200         activation_2[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 44, 44, 16)   64          separable_conv2d_1[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 44, 44, 16)   0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 44, 44, 16)   400         activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 44, 44, 16)   64          separable_conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 22, 22, 16)   128         activation_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 22, 22, 16)   0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 22, 22, 16)   64          conv2d_3[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 22, 22, 16)   0           max_pooling2d_1[0][0]
                                                                 batch_normalization_3[0][0]
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 22, 22, 32)   656         add_1[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 22, 22, 32)   128         separable_conv2d_3[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 22, 22, 32)   0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 22, 22, 32)   1312        activation_4[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 22, 22, 32)   128         separable_conv2d_4[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 11, 11, 32)   512         add_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 11, 11, 32)   0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 11, 11, 32)   128         conv2d_4[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 11, 11, 32)   0           max_pooling2d_2[0][0]
                                                                 batch_normalization_6[0][0]
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 11, 11, 64)   2336        add_2[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 11, 11, 64)   256         separable_conv2d_5[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 11, 11, 64)   0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 11, 11, 64)   4672        activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 11, 11, 64)   256         separable_conv2d_6[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 6, 6, 64)     2048        add_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 6, 6, 64)     0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 6, 6, 64)     256         conv2d_5[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 6, 6, 64)     0           max_pooling2d_3[0][0]
                                                                 batch_normalization_9[0][0]
__________________________________________________________________________________________________
separable_conv2d_7 (SeparableCo (None, 6, 6, 128)    8768        add_3[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 6, 6, 128)    512         separable_conv2d_7[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 6, 6, 128)    0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
separable_conv2d_8 (SeparableCo (None, 6, 6, 128)    17536       activation_6[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 6, 6, 128)    512         separable_conv2d_8[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 3, 3, 128)    8192        add_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 3, 3, 128)    0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 3, 3, 128)    512         conv2d_6[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 3, 3, 128)    0           max_pooling2d_4[0][0]
                                                                 batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 3, 3, 6)      6918        add_4[0][0]
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 6)            0           conv2d_7[0][0]
__________________________________________________________________________________________________
predictions (Activation)        (None, 6)            0           global_average_pooling2d_1[0][0]
==================================================================================================
Total params: 57,270
Trainable params: 55,798
Non-trainable params: 1,472
__________________________________________________________________________________________________
WARNING:tensorflow:From C:\Users\Bogdan\AppData\Local\Programs\Python\Python37\lib\site-packages\keras\backend\tensorflow_backend.py:422: The name tf.global_variables is deprecated. Please use tf.compat.v1.global_variables instead.

Epoch 1/110
2019-12-08 17:53:33.793074: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cudnn64_7.dll
2019-12-08 17:53:34.825343: W tensorflow/stream_executor/cuda/redzone_allocator.cc:312] Internal: Invoking ptxas not supported on Windows
Relying on driver to perform ptx compilation. This message will be only logged once.
2019-12-08 17:53:34.885222: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library cublas64_100.dll
707/706 [==============================] - 55s 78ms/step - loss: 0.1556 - accuracy: 0.2977 - val_loss: 0.1290 - val_accuracy: 0.3699

Epoch 00001: val_loss improved from inf to 0.12899, saving model to models/_mini_XCEPTION.01-0.37.hdf5
Epoch 2/110
707/706 [==============================] - 50s 70ms/step - loss: 0.1232 - accuracy: 0.4036 - val_loss: 0.1194 - val_accuracy: 0.4338

Epoch 00002: val_loss improved from 0.12899 to 0.11935, saving model to models/_mini_XCEPTION.02-0.43.hdf5
Epoch 3/110
707/706 [==============================] - 49s 70ms/step - loss: 0.1144 - accuracy: 0.4526 - val_loss: 0.1366 - val_accuracy: 0.3611

Epoch 00003: val_loss did not improve from 0.11935
Epoch 4/110
707/706 [==============================] - 50s 70ms/step - loss: 0.1091 - accuracy: 0.4822 - val_loss: 0.1175 - val_accuracy: 0.4497

Epoch 00004: val_loss improved from 0.11935 to 0.11745, saving model to models/_mini_XCEPTION.04-0.45.hdf5
Epoch 5/110
707/706 [==============================] - 49s 70ms/step - loss: 0.1056 - accuracy: 0.5038 - val_loss: 0.1103 - val_accuracy: 0.4817

Epoch 00005: val_loss improved from 0.11745 to 0.11028, saving model to models/_mini_XCEPTION.05-0.48.hdf5
Epoch 6/110
707/706 [==============================] - 50s 70ms/step - loss: 0.1027 - accuracy: 0.5186 - val_loss: 0.1017 - val_accuracy: 0.5178

Epoch 00006: val_loss improved from 0.11028 to 0.10172, saving model to models/_mini_XCEPTION.06-0.52.hdf5
Epoch 7/110
707/706 [==============================] - 49s 70ms/step - loss: 0.1012 - accuracy: 0.5280 - val_loss: 0.1007 - val_accuracy: 0.5372

Epoch 00007: val_loss improved from 0.10172 to 0.10073, saving model to models/_mini_XCEPTION.07-0.54.hdf5
Epoch 8/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0993 - accuracy: 0.5384 - val_loss: 0.1030 - val_accuracy: 0.5149

Epoch 00008: val_loss did not improve from 0.10073
Epoch 9/110
707/706 [==============================] - 50s 71ms/step - loss: 0.0977 - accuracy: 0.5466 - val_loss: 0.0976 - val_accuracy: 0.5478

Epoch 00009: val_loss improved from 0.10073 to 0.09755, saving model to models/_mini_XCEPTION.09-0.55.hdf5
Epoch 10/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0966 - accuracy: 0.5553 - val_loss: 0.0961 - val_accuracy: 0.5625

Epoch 00010: val_loss improved from 0.09755 to 0.09606, saving model to models/_mini_XCEPTION.10-0.56.hdf5
Epoch 11/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0955 - accuracy: 0.5616 - val_loss: 0.0985 - val_accuracy: 0.5447

Epoch 00011: val_loss did not improve from 0.09606
Epoch 12/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0945 - accuracy: 0.5642 - val_loss: 0.0964 - val_accuracy: 0.5567

Epoch 00012: val_loss did not improve from 0.09606
Epoch 13/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0934 - accuracy: 0.5737 - val_loss: 0.1089 - val_accuracy: 0.5082

Epoch 00013: val_loss did not improve from 0.09606
Epoch 14/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0924 - accuracy: 0.5778 - val_loss: 0.0928 - val_accuracy: 0.5726

Epoch 00014: val_loss improved from 0.09606 to 0.09277, saving model to models/_mini_XCEPTION.14-0.57.hdf5
Epoch 15/110
707/706 [==============================] - 51s 72ms/step - loss: 0.0922 - accuracy: 0.5810 - val_loss: 0.0919 - val_accuracy: 0.5761

Epoch 00015: val_loss improved from 0.09277 to 0.09186, saving model to models/_mini_XCEPTION.15-0.58.hdf5
Epoch 16/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0912 - accuracy: 0.5844 - val_loss: 0.0921 - val_accuracy: 0.5742

Epoch 00016: val_loss did not improve from 0.09186
Epoch 17/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0909 - accuracy: 0.5856 - val_loss: 0.0934 - val_accuracy: 0.5761

Epoch 00017: val_loss did not improve from 0.09186
Epoch 18/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0906 - accuracy: 0.5859 - val_loss: 0.0954 - val_accuracy: 0.5563

Epoch 00018: val_loss did not improve from 0.09186
Epoch 19/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0898 - accuracy: 0.5879 - val_loss: 0.0924 - val_accuracy: 0.5828

Epoch 00019: val_loss did not improve from 0.09186
Epoch 20/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0891 - accuracy: 0.5965 - val_loss: 0.0917 - val_accuracy: 0.5827

Epoch 00020: val_loss improved from 0.09186 to 0.09175, saving model to models/_mini_XCEPTION.20-0.58.hdf5
Epoch 21/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0889 - accuracy: 0.5938 - val_loss: 0.0935 - val_accuracy: 0.5719

Epoch 00021: val_loss did not improve from 0.09175
Epoch 22/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0889 - accuracy: 0.5972 - val_loss: 0.0914 - val_accuracy: 0.5855

Epoch 00022: val_loss improved from 0.09175 to 0.09143, saving model to models/_mini_XCEPTION.22-0.59.hdf5
Epoch 23/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0882 - accuracy: 0.5990 - val_loss: 0.0912 - val_accuracy: 0.5827

Epoch 00023: val_loss improved from 0.09143 to 0.09119, saving model to models/_mini_XCEPTION.23-0.58.hdf5
Epoch 24/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0875 - accuracy: 0.6050 - val_loss: 0.0919 - val_accuracy: 0.5805

Epoch 00024: val_loss did not improve from 0.09119
Epoch 25/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0873 - accuracy: 0.6043 - val_loss: 0.0911 - val_accuracy: 0.5818

Epoch 00025: val_loss improved from 0.09119 to 0.09111, saving model to models/_mini_XCEPTION.25-0.58.hdf5
Epoch 26/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0870 - accuracy: 0.6055 - val_loss: 0.0964 - val_accuracy: 0.5620

Epoch 00026: val_loss did not improve from 0.09111
Epoch 27/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0868 - accuracy: 0.6090 - val_loss: 0.0877 - val_accuracy: 0.6057

Epoch 00027: val_loss improved from 0.09111 to 0.08771, saving model to models/_mini_XCEPTION.27-0.61.hdf5
Epoch 28/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0863 - accuracy: 0.6087 - val_loss: 0.0911 - val_accuracy: 0.5901

Epoch 00028: val_loss did not improve from 0.08771
Epoch 29/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0859 - accuracy: 0.6132 - val_loss: 0.0922 - val_accuracy: 0.5883

Epoch 00029: val_loss did not improve from 0.08771
Epoch 30/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0855 - accuracy: 0.6157 - val_loss: 0.0908 - val_accuracy: 0.5912

Epoch 00030: val_loss did not improve from 0.08771
Epoch 31/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0845 - accuracy: 0.6218 - val_loss: 0.0893 - val_accuracy: 0.5989

Epoch 00031: val_loss did not improve from 0.08771
Epoch 32/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0847 - accuracy: 0.6215 - val_loss: 0.0901 - val_accuracy: 0.5899

Epoch 00032: val_loss did not improve from 0.08771
Epoch 33/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0843 - accuracy: 0.6227 - val_loss: 0.0866 - val_accuracy: 0.6117

Epoch 00033: val_loss improved from 0.08771 to 0.08658, saving model to models/_mini_XCEPTION.33-0.61.hdf5
Epoch 34/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0844 - accuracy: 0.6190 - val_loss: 0.0883 - val_accuracy: 0.6018

Epoch 00034: val_loss did not improve from 0.08658
Epoch 35/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0841 - accuracy: 0.6239 - val_loss: 0.0878 - val_accuracy: 0.6028

Epoch 00035: val_loss did not improve from 0.08658
Epoch 36/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0837 - accuracy: 0.6236 - val_loss: 0.0876 - val_accuracy: 0.6030

Epoch 00036: val_loss did not improve from 0.08658
Epoch 37/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0840 - accuracy: 0.6247 - val_loss: 0.0860 - val_accuracy: 0.6088

Epoch 00037: val_loss improved from 0.08658 to 0.08603, saving model to models/_mini_XCEPTION.37-0.61.hdf5
Epoch 38/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0829 - accuracy: 0.6286 - val_loss: 0.0909 - val_accuracy: 0.5922

Epoch 00038: val_loss did not improve from 0.08603
Epoch 39/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0827 - accuracy: 0.6341 - val_loss: 0.0895 - val_accuracy: 0.5988

Epoch 00039: val_loss did not improve from 0.08603
Epoch 40/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0825 - accuracy: 0.6313 - val_loss: 0.0898 - val_accuracy: 0.5873

Epoch 00040: val_loss did not improve from 0.08603
Epoch 41/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0829 - accuracy: 0.6288 - val_loss: 0.0870 - val_accuracy: 0.6039

Epoch 00041: val_loss did not improve from 0.08603
Epoch 42/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0821 - accuracy: 0.6347 - val_loss: 0.0869 - val_accuracy: 0.6074

Epoch 00042: val_loss did not improve from 0.08603
Epoch 43/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0822 - accuracy: 0.6321 - val_loss: 0.0864 - val_accuracy: 0.6138

Epoch 00043: val_loss did not improve from 0.08603
Epoch 44/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0818 - accuracy: 0.6343 - val_loss: 0.0863 - val_accuracy: 0.6152

Epoch 00044: val_loss did not improve from 0.08603
Epoch 45/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0811 - accuracy: 0.6389 - val_loss: 0.0922 - val_accuracy: 0.5882

Epoch 00045: val_loss did not improve from 0.08603
Epoch 46/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0811 - accuracy: 0.6379 - val_loss: 0.0850 - val_accuracy: 0.6251

Epoch 00046: val_loss improved from 0.08603 to 0.08498, saving model to models/_mini_XCEPTION.46-0.63.hdf5
Epoch 47/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0808 - accuracy: 0.6390 - val_loss: 0.0871 - val_accuracy: 0.6157

Epoch 00047: val_loss did not improve from 0.08498
Epoch 48/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0807 - accuracy: 0.6434 - val_loss: 0.0843 - val_accuracy: 0.6246

Epoch 00048: val_loss improved from 0.08498 to 0.08431, saving model to models/_mini_XCEPTION.48-0.62.hdf5
Epoch 49/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0809 - accuracy: 0.6398 - val_loss: 0.0853 - val_accuracy: 0.6187

Epoch 00049: val_loss did not improve from 0.08431
Epoch 50/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0809 - accuracy: 0.6428 - val_loss: 0.0846 - val_accuracy: 0.6233

Epoch 00050: val_loss did not improve from 0.08431
Epoch 51/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0801 - accuracy: 0.6475 - val_loss: 0.0852 - val_accuracy: 0.6195

Epoch 00051: val_loss did not improve from 0.08431
Epoch 52/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0799 - accuracy: 0.6490 - val_loss: 0.0906 - val_accuracy: 0.5926

Epoch 00052: val_loss did not improve from 0.08431
Epoch 53/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0803 - accuracy: 0.6411 - val_loss: 0.0890 - val_accuracy: 0.6060

Epoch 00053: val_loss did not improve from 0.08431
Epoch 54/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0800 - accuracy: 0.6470 - val_loss: 0.0868 - val_accuracy: 0.6124

Epoch 00054: val_loss did not improve from 0.08431
Epoch 55/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0796 - accuracy: 0.6478 - val_loss: 0.0888 - val_accuracy: 0.6111

Epoch 00055: val_loss did not improve from 0.08431
Epoch 56/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0798 - accuracy: 0.6471 - val_loss: 0.0887 - val_accuracy: 0.6097

Epoch 00056: val_loss did not improve from 0.08431
Epoch 57/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0796 - accuracy: 0.6476 - val_loss: 0.0864 - val_accuracy: 0.6147

Epoch 00057: val_loss did not improve from 0.08431
Epoch 58/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0794 - accuracy: 0.6467 - val_loss: 0.0880 - val_accuracy: 0.6019

Epoch 00058: val_loss did not improve from 0.08431
Epoch 59/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0793 - accuracy: 0.6486 - val_loss: 0.0845 - val_accuracy: 0.6292

Epoch 00059: val_loss did not improve from 0.08431
Epoch 60/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0790 - accuracy: 0.6519 - val_loss: 0.0875 - val_accuracy: 0.6113

Epoch 00060: val_loss did not improve from 0.08431

Epoch 00060: ReduceLROnPlateau reducing learning rate to 0.00010000000474974513.
Epoch 61/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0751 - accuracy: 0.6700 - val_loss: 0.0807 - val_accuracy: 0.6417

Epoch 00061: val_loss improved from 0.08431 to 0.08067, saving model to models/_mini_XCEPTION.61-0.64.hdf5
Epoch 62/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0737 - accuracy: 0.6792 - val_loss: 0.0800 - val_accuracy: 0.6453

Epoch 00062: val_loss improved from 0.08067 to 0.07999, saving model to models/_mini_XCEPTION.62-0.65.hdf5
Epoch 63/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0734 - accuracy: 0.6789 - val_loss: 0.0801 - val_accuracy: 0.6442

Epoch 00063: val_loss did not improve from 0.07999
Epoch 64/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0721 - accuracy: 0.6874 - val_loss: 0.0800 - val_accuracy: 0.6440

Epoch 00064: val_loss did not improve from 0.07999
Epoch 65/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0722 - accuracy: 0.6852 - val_loss: 0.0798 - val_accuracy: 0.6488

Epoch 00065: val_loss improved from 0.07999 to 0.07976, saving model to models/_mini_XCEPTION.65-0.65.hdf5
Epoch 66/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0724 - accuracy: 0.6849 - val_loss: 0.0797 - val_accuracy: 0.6463

Epoch 00066: val_loss improved from 0.07976 to 0.07969, saving model to models/_mini_XCEPTION.66-0.65.hdf5
Epoch 67/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0721 - accuracy: 0.6843 - val_loss: 0.0797 - val_accuracy: 0.6439

Epoch 00067: val_loss did not improve from 0.07969
Epoch 68/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0717 - accuracy: 0.6876 - val_loss: 0.0797 - val_accuracy: 0.6451

Epoch 00068: val_loss improved from 0.07969 to 0.07967, saving model to models/_mini_XCEPTION.68-0.65.hdf5
Epoch 69/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0718 - accuracy: 0.6880 - val_loss: 0.0796 - val_accuracy: 0.6449

Epoch 00069: val_loss improved from 0.07967 to 0.07961, saving model to models/_mini_XCEPTION.69-0.64.hdf5
Epoch 70/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0715 - accuracy: 0.6902 - val_loss: 0.0791 - val_accuracy: 0.6525

Epoch 00070: val_loss improved from 0.07961 to 0.07906, saving model to models/_mini_XCEPTION.70-0.65.hdf5
Epoch 71/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0716 - accuracy: 0.6889 - val_loss: 0.0795 - val_accuracy: 0.6410

Epoch 00071: val_loss did not improve from 0.07906
Epoch 72/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0716 - accuracy: 0.6877 - val_loss: 0.0791 - val_accuracy: 0.6462

Epoch 00072: val_loss did not improve from 0.07906
Epoch 73/110
707/706 [==============================] - 49s 70ms/step - loss: 0.0710 - accuracy: 0.6888 - val_loss: 0.0800 - val_accuracy: 0.6454

Epoch 00073: val_loss did not improve from 0.07906
Epoch 74/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0708 - accuracy: 0.6926 - val_loss: 0.0791 - val_accuracy: 0.6502

Epoch 00074: val_loss did not improve from 0.07906
Epoch 75/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0708 - accuracy: 0.6917 - val_loss: 0.0799 - val_accuracy: 0.6492

Epoch 00075: val_loss did not improve from 0.07906
Epoch 76/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0709 - accuracy: 0.6908 - val_loss: 0.0799 - val_accuracy: 0.6428

Epoch 00076: val_loss did not improve from 0.07906
Epoch 77/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0711 - accuracy: 0.6920 - val_loss: 0.0801 - val_accuracy: 0.6454

Epoch 00077: val_loss did not improve from 0.07906
Epoch 78/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0711 - accuracy: 0.6913 - val_loss: 0.0795 - val_accuracy: 0.6513

Epoch 00078: val_loss did not improve from 0.07906
Epoch 79/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0707 - accuracy: 0.6918 - val_loss: 0.0793 - val_accuracy: 0.6492

Epoch 00079: val_loss did not improve from 0.07906
Epoch 80/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0707 - accuracy: 0.6919 - val_loss: 0.0797 - val_accuracy: 0.6460

Epoch 00080: val_loss did not improve from 0.07906
Epoch 81/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0705 - accuracy: 0.6962 - val_loss: 0.0792 - val_accuracy: 0.6472

Epoch 00081: val_loss did not improve from 0.07906
Epoch 82/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0709 - accuracy: 0.6910 - val_loss: 0.0803 - val_accuracy: 0.6462

Epoch 00082: val_loss did not improve from 0.07906

Epoch 00082: ReduceLROnPlateau reducing learning rate to 1.0000000474974514e-05.
Epoch 83/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6995 - val_loss: 0.0793 - val_accuracy: 0.6486

Epoch 00083: val_loss did not improve from 0.07906
Epoch 84/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0698 - accuracy: 0.6962 - val_loss: 0.0793 - val_accuracy: 0.6483

Epoch 00084: val_loss did not improve from 0.07906
Epoch 85/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6976 - val_loss: 0.0792 - val_accuracy: 0.6477

Epoch 00085: val_loss did not improve from 0.07906
Epoch 86/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0699 - accuracy: 0.6956 - val_loss: 0.0792 - val_accuracy: 0.6481

Epoch 00086: val_loss did not improve from 0.07906
Epoch 87/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6977 - val_loss: 0.0792 - val_accuracy: 0.6488

Epoch 00087: val_loss did not improve from 0.07906
Epoch 88/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0698 - accuracy: 0.6976 - val_loss: 0.0792 - val_accuracy: 0.6481

Epoch 00088: val_loss did not improve from 0.07906
Epoch 89/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0701 - accuracy: 0.6940 - val_loss: 0.0791 - val_accuracy: 0.6479

Epoch 00089: val_loss did not improve from 0.07906
Epoch 90/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0698 - accuracy: 0.6985 - val_loss: 0.0791 - val_accuracy: 0.6490

Epoch 00090: val_loss improved from 0.07906 to 0.07906, saving model to models/_mini_XCEPTION.90-0.65.hdf5
Epoch 91/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0695 - accuracy: 0.6972 - val_loss: 0.0791 - val_accuracy: 0.6499

Epoch 00091: val_loss did not improve from 0.07906
Epoch 92/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6955 - val_loss: 0.0790 - val_accuracy: 0.6477

Epoch 00092: val_loss improved from 0.07906 to 0.07901, saving model to models/_mini_XCEPTION.92-0.65.hdf5
Epoch 93/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0699 - accuracy: 0.6959 - val_loss: 0.0790 - val_accuracy: 0.6509

Epoch 00093: val_loss improved from 0.07901 to 0.07898, saving model to models/_mini_XCEPTION.93-0.65.hdf5
Epoch 94/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6970 - val_loss: 0.0791 - val_accuracy: 0.6515

Epoch 00094: val_loss did not improve from 0.07898

Epoch 00094: ReduceLROnPlateau reducing learning rate to 1.0000000656873453e-06.
Epoch 95/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0695 - accuracy: 0.6966 - val_loss: 0.0791 - val_accuracy: 0.6511

Epoch 00095: val_loss did not improve from 0.07898
Epoch 96/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0702 - accuracy: 0.6944 - val_loss: 0.0791 - val_accuracy: 0.6513

Epoch 00096: val_loss did not improve from 0.07898
Epoch 97/110
707/706 [==============================] - 50s 71ms/step - loss: 0.0701 - accuracy: 0.6950 - val_loss: 0.0790 - val_accuracy: 0.6502

Epoch 00097: val_loss did not improve from 0.07898
Epoch 98/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6967 - val_loss: 0.0790 - val_accuracy: 0.6511

Epoch 00098: val_loss did not improve from 0.07898
Epoch 99/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0692 - accuracy: 0.6995 - val_loss: 0.0790 - val_accuracy: 0.6508

Epoch 00099: val_loss did not improve from 0.07898
Epoch 100/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0702 - accuracy: 0.6945 - val_loss: 0.0790 - val_accuracy: 0.6511

Epoch 00100: val_loss did not improve from 0.07898
Epoch 101/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0693 - accuracy: 0.7010 - val_loss: 0.0790 - val_accuracy: 0.6513

Epoch 00101: val_loss did not improve from 0.07898
Epoch 102/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0699 - accuracy: 0.6949 - val_loss: 0.0791 - val_accuracy: 0.6513

Epoch 00102: val_loss did not improve from 0.07898
Epoch 103/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0696 - accuracy: 0.6979 - val_loss: 0.0791 - val_accuracy: 0.6502

Epoch 00103: val_loss did not improve from 0.07898
Epoch 104/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0697 - accuracy: 0.6979 - val_loss: 0.0790 - val_accuracy: 0.6508

Epoch 00104: val_loss did not improve from 0.07898
Epoch 105/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0695 - accuracy: 0.6963 - val_loss: 0.0790 - val_accuracy: 0.6518

Epoch 00105: val_loss did not improve from 0.07898
Epoch 106/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0696 - accuracy: 0.6992 - val_loss: 0.0791 - val_accuracy: 0.6495

Epoch 00106: val_loss did not improve from 0.07898

Epoch 00106: ReduceLROnPlateau reducing learning rate to 1.0000001111620805e-07.
Epoch 107/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0695 - accuracy: 0.7013 - val_loss: 0.0791 - val_accuracy: 0.6502

Epoch 00107: val_loss did not improve from 0.07898
Epoch 108/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0699 - accuracy: 0.6949 - val_loss: 0.0791 - val_accuracy: 0.6502

Epoch 00108: val_loss did not improve from 0.07898
Epoch 109/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0702 - accuracy: 0.6957 - val_loss: 0.0790 - val_accuracy: 0.6508

Epoch 00109: val_loss did not improve from 0.07898
Epoch 110/110
707/706 [==============================] - 50s 70ms/step - loss: 0.0694 - accuracy: 0.7012 - val_loss: 0.0791 - val_accuracy: 0.6513

Epoch 00110: val_loss did not improve from 0.07898